<h2>Описание</h2>
<div>
    <p>Данный блок поиск использутеся для фильтрации данных на сайте art-mx</p>
</div>


<h2>Задачи поиска</h2>
<h3>Поиск по списку</h3>
<ul>
    <li>Фокусировка по текстовому полю открывает список значений в модальном окне.</li>
    <li>Ввод значения в текстовое поле фильтрует список по этому значению.</li>
    <li>Модальное окно со списком закрывает по кресту или по клику вне окна и фильтра.</li>
    <li>При скролле поиск модальное окно движется вместе с активированным полем фильтра.</li>
</ul>
<h3>Поиск по промежутку</h3>
<ul>
    <li></li>
</ul>

